keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMsc_regdef.h
/** \\brief  Downstream Select Data Source Low Register */
typedef struct _Ifx_MSC_DSDSL_Bits
{
    unsigned int SL0:2;                     /**< \brief [1:0] Select Source for SRL (rw) */
    unsigned int SL1:2;                     /**< \brief [3:2] Select Source for SRL (rw) */
    unsigned int SL2:2;                     /**< \brief [5:4] Select Source for SRL (rw) */
    unsigned int SL3:2;                     /**< \brief [7:6] Select Source for SRL (rw) */
    unsigned int SL4:2;                     /**< \brief [9:8] Select Source for SRL (rw) */
    unsigned int SL5:2;                     /**< \brief [11:10] Select Source for SRL (rw) */
    unsigned int SL6:2;                     /**< \brief [13:12] Select Source for SRL (rw) */
    unsigned int SL7:2;                     /**< \brief [15:14] Select Source for SRL (rw) */
    unsigned int SL8:2;                     /**< \brief [17:16] Select Source for SRL (rw) */
    unsigned int SL9:2;                     /**< \brief [19:18] Select Source for SRL (rw) */
    unsigned int SL10:2;                    /**< \brief [21:20] Select Source for SRL (rw) */
    unsigned int SL11:2;                    /**< \brief [23:22] Select Source for SRL (rw) */
    unsigned int SL12:2;                    /**< \brief [25:24] Select Source for SRL (rw) */
    unsigned int SL13:2;                    /**< \brief [27:26] Select Source for SRL (rw) */
    unsigned int SL14:2;                    /**< \brief [29:28] Select Source for SRL (rw) */
    unsigned int SL15:2;                    /**< \brief [31:30] Select Source for SRL (rw) */
} Ifx_MSC_DSDSL_Bits;

/** \\brief  Downstream Select Data Source Low Extension Register */
typedef struct _Ifx_MSC_DSDSLE_Bits
{
    unsigned int SL16:2;                    /**< \brief [1:0] Select Source for SRL (rw) */
    unsigned int SL17:2;                    /**< \brief [3:2] Select Source for SRL (rw) */
    unsigned int SL18:2;                    /**< \brief [5:4] Select Source for SRL (rw) */
    unsigned int SL19:2;                    /**< \brief [7:6] Select Source for SRL (rw) */
    unsigned int SL20:2;                    /**< \brief [9:8] Select Source for SRL (rw) */
    unsigned int SL21:2;                    /**< \brief [11:10] Select Source for SRL (rw) */
    unsigned int SL22:2;                    /**< \brief [13:12] Select Source for SRL (rw) */
    unsigned int SL23:2;                    /**< \brief [15:14] Select Source for SRL (rw) */
    unsigned int SL24:2;                    /**< \brief [17:16] Select Source for SRL (rw) */
    unsigned int SL25:2;                    /**< \brief [19:18] Select Source for SRL (rw) */
    unsigned int SL26:2;                    /**< \brief [21:20] Select Source for SRL (rw) */
    unsigned int SL27:2;                    /**< \brief [23:22] Select Source for SRL (rw) */
    unsigned int SL28:2;                    /**< \brief [25:24] Select Source for SRL (rw) */
    unsigned int SL29:2;                    /**< \brief [27:26] Select Source for SRL (rw) */
    unsigned int SL30:2;                    /**< \brief [29:28] Select Source for SRL (rw) */
    unsigned int SL31:2;                    /**< \brief [31:30] Select Source for SRL (rw) */
} Ifx_MSC_DSDSLE_Bits;

/** \\brief  Downstream Status Register */
typedef struct _Ifx_MSC_DSS_Bits
{
    unsigned int PFC:4;                     /**< \brief [3:0] Passive Time Frame Counter (rh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int NPTF:4;                    /**< \brief [11:8] Number Of Passive Time Frames (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int DC:8;                      /**< \brief [23:16] Downstream Counter (rh) */
    unsigned int DFA:1;                     /**< \brief [24:24] Data Frame Active (rh) */
    unsigned int CFA:1;                     /**< \brief [25:25] Command Frame Active (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_MSC_DSS_Bits;

/** \\brief  Downstream Timing Extension Register */
typedef struct _Ifx_MSC_DSTE_Bits
{
    unsigned int PPDE:2;                    /**< \brief [1:0] Passive Phase Length at Data Frames Extension (rw) */
    unsigned int PPCE:6;                    /**< \brief [7:2] Passive Phase Length at Control Frames Extension (rw) */
    unsigned int NDD:4;                     /**< \brief [11:8] N Divider Downstream (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_MSC_DSTE_Bits;

/** \\brief  Emergency Stop Register */
typedef struct _Ifx_MSC_ESR_Bits
{
    unsigned int ENL0:1;                    /**< \brief [0:0] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL1:1;                    /**< \brief [1:1] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL2:1;                    /**< \brief [2:2] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL3:1;                    /**< \brief [3:3] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL4:1;                    /**< \brief [4:4] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL5:1;                    /**< \brief [5:5] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL6:1;                    /**< \brief [6:6] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL7:1;                    /**< \brief [7:7] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL8:1;                    /**< \brief [8:8] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL9:1;                    /**< \brief [9:9] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL10:1;                   /**< \brief [10:10] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL11:1;                   /**< \brief [11:11] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL12:1;                   /**< \brief [12:12] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL13:1;                   /**< \brief [13:13] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL14:1;                   /**< \brief [14:14] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL15:1;                   /**< \brief [15:15] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENH0:1;                    /**< \brief [16:16] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH1:1;                    /**< \brief [17:17] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH2:1;                    /**< \brief [18:18] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH3:1;                    /**< \brief [19:19] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH4:1;                    /**< \brief [20:20] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH5:1;                    /**< \brief [21:21] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH6:1;                    /**< \brief [22:22] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH7:1;                    /**< \brief [23:23] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH8:1;                    /**< \brief [24:24] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH9:1;                    /**< \brief [25:25] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH10:1;                   /**< \brief [26:26] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH11:1;                   /**< \brief [27:27] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH12:1;                   /**< \brief [28:28] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH13:1;                   /**< \brief [29:29] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH14:1;                   /**< \brief [30:30] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH15:1;                   /**< \brief [31:31] Emergency Stop Enable for Bit x in SRH (rw) */
} Ifx_MSC_ESR_Bits;

/** \\brief  Emergency Stop Extension Register */
typedef struct _Ifx_MSC_ESRE_Bits
{
    unsigned int ENL16:1;                   /**< \brief [0:0] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL17:1;                   /**< \brief [1:1] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL18:1;                   /**< \brief [2:2] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL19:1;                   /**< \brief [3:3] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL20:1;                   /**< \brief [4:4] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL21:1;                   /**< \brief [5:5] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL22:1;                   /**< \brief [6:6] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL23:1;                   /**< \brief [7:7] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL24:1;                   /**< \brief [8:8] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL25:1;                   /**< \brief [9:9] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL26:1;                   /**< \brief [10:10] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL27:1;                   /**< \brief [11:11] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL28:1;                   /**< \brief [12:12] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL29:1;                   /**< \brief [13:13] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL30:1;                   /**< \brief [14:14] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL31:1;                   /**< \brief [15:15] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENH16:1;                   /**< \brief [16:16] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH17:1;                   /**< \brief [17:17] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH18:1;                   /**< \brief [18:18] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH19:1;                   /**< \brief [19:19] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH20:1;                   /**< \brief [20:20] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH21:1;                   /**< \brief [21:21] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH22:1;                   /**< \brief [22:22] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH23:1;                   /**< \brief [23:23] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH24:1;                   /**< \brief [24:24] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH25:1;                   /**< \brief [25:25] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH26:1;                   /**< \brief [26:26] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH27:1;                   /**< \brief [27:27] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH28:1;                   /**< \brief [28:28] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH29:1;                   /**< \brief [29:29] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH30:1;                   /**< \brief [30:30] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH31:1;                   /**< \brief [31:31] Emergency Stop Enable for Bit x in SRH (rw) */
} Ifx_MSC_ESRE_Bits;

