keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMsc_regdef.h
/** \\brief  Fractional Divider Register */
typedef struct _Ifx_MSC_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:4;             /**< \brief \internal Reserved */
    unsigned int ENHW:1;                    /**< \brief [30:30] Enable Hardware Clock Control (rw) */
    unsigned int DISCLK:1;                  /**< \brief [31:31] Disable Clock (rwh) */
} Ifx_MSC_FDR_Bits;

/** \\brief  Interrupt Control Register */
typedef struct _Ifx_MSC_ICR_Bits
{
    unsigned int EDIP:2;                    /**< \brief [1:0] Data Frame Interrupt Node Pointer (rw) */
    unsigned int EDIE:2;                    /**< \brief [3:2] Data Frame Interrupt Enable (rw) */
    unsigned int ECIP:2;                    /**< \brief [5:4] Command Frame Interrupt Node Pointer (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int ECIE:1;                    /**< \brief [7:7] Command Frame Interrupt Enable (rw) */
    unsigned int TFIP:2;                    /**< \brief [9:8] Time Frame Interrupt Pointer (rw) */
    unsigned int reserved_10:1;             /**< \brief \internal Reserved */
    unsigned int TFIE:1;                    /**< \brief [11:11] Time Frame Interrupt Enable (rw) */
    unsigned int RDIP:2;                    /**< \brief [13:12] Receive Data Interrupt Pointer (rw) */
    unsigned int RDIE:2;                    /**< \brief [15:14] Receive Data Interrupt Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_MSC_ICR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_MSC_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_MSC_ID_Bits;

/** \\brief  Interrupt Set Clear Register */
typedef struct _Ifx_MSC_ISC_Bits
{
    unsigned int CDEDI:1;                   /**< \brief [0:0] Clear DEDI Flag (w) */
    unsigned int CDECI:1;                   /**< \brief [1:1] Clear DECI Flag (w) */
    unsigned int CDTFI:1;                   /**< \brief [2:2] Clear DTFI Flag (w) */
    unsigned int CURDI:1;                   /**< \brief [3:3] Clear URDI Flag (w) */
    unsigned int CDP:1;                     /**< \brief [4:4] Clear DP Flag (w) */
    unsigned int CCP:1;                     /**< \brief [5:5] Clear CP Flag (w) */
    unsigned int CDDIS:1;                   /**< \brief [6:6] Clear DSDIS Flag (w) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int SDEDI:1;                   /**< \brief [16:16] Set DEDI Flag (w) */
    unsigned int SDECI:1;                   /**< \brief [17:17] Set DECI Flag (w) */
    unsigned int SDTFI:1;                   /**< \brief [18:18] Set DTFI Flag (w) */
    unsigned int SURDI:1;                   /**< \brief [19:19] Set URDI Flag (w) */
    unsigned int SDP:1;                     /**< \brief [20:20] Set DP Bit (w) */
    unsigned int SCP:1;                     /**< \brief [21:21] Set CP Flag (w) */
    unsigned int SDDIS:1;                   /**< \brief [22:22] Set DSDIS Flag (w) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_MSC_ISC_Bits;

/** \\brief  Interrupt Status Register */
typedef struct _Ifx_MSC_ISR_Bits
{
    unsigned int DEDI:1;                    /**< \brief [0:0] Data Frame Interrupt Flag (rh) */
    unsigned int DECI:1;                    /**< \brief [1:1] Command Frame Interrupt Flag (rh) */
    unsigned int DTFI:1;                    /**< \brief [2:2] Time Frame Interrupt Flag (rh) */
    unsigned int URDI:1;                    /**< \brief [3:3] Receive Data Interrupt Flag (rh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_MSC_ISR_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_MSC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_MSC_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_MSC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_MSC_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_MSC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_MSC_KRSTCLR_Bits;

/** \\brief  Output Control Register */
typedef struct _Ifx_MSC_OCR_Bits
{
    unsigned int CLP:1;                     /**< \brief [0:0] FCLP Line Polarity (rw) */
    unsigned int SLP:1;                     /**< \brief [1:1] SOP Line Polarity (rw) */
    unsigned int CSLP:1;                    /**< \brief [2:2] Chip Selection Lines Polarity (rw) */
    unsigned int ILP:1;                     /**< \brief [3:3] SDI Line Polarity (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int CLKCTRL:1;                 /**< \brief [8:8] Clock Control (rw) */
    unsigned int CSL:2;                     /**< \brief [10:9] Chip Enable Selection for ENL (rw) */
    unsigned int CSH:2;                     /**< \brief [12:11] Chip Enable Selection for ENH (rw) */
    unsigned int CSC:2;                     /**< \brief [14:13] Chip Enable Selection for ENC (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int SDISEL:3;                  /**< \brief [18:16] Serial Data Input Selection (rw) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_MSC_OCR_Bits;

