keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMsc_regdef.h
/** \\brief  OCDS Control and Status */
typedef struct _Ifx_MSC_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_MSC_OCS_Bits;

/** \\brief  Upstream Data Register */
typedef struct _Ifx_MSC_UD_Bits
{
    unsigned int DATA:8;                    /**< \brief [7:0] Received Data (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int V:1;                       /**< \brief [16:16] Valid Bit (rh) */
    unsigned int P:1;                       /**< \brief [17:17] Parity Bit (rh) */
    unsigned int C:1;                       /**< \brief [18:18] Clear Bit (w) */
    unsigned int LABF:2;                    /**< \brief [20:19] Lower Address Bit Field (rh) */
    unsigned int IPF:1;                     /**< \brief [21:21] Internal Parity Flag (rh) */
    unsigned int PERR:1;                    /**< \brief [22:22] Parity Error (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_MSC_UD_Bits;

/** \\brief  Upstream Control Enhanced Register 1 */
typedef struct _Ifx_MSC_USCE_Bits
{
    unsigned int USTOPRE:4;                 /**< \brief [3:0] Upstream Timeout Prescaler (rw) */
    unsigned int USTOVAL:4;                 /**< \brief [7:4] Upstream Timeout Value (rw) */
    unsigned int USTOEN:1;                  /**< \brief [8:8] Upstream Timeout Interrupt Enable (rw) */
    unsigned int USTF:1;                    /**< \brief [9:9] Upstream Timeout Flag (rh) */
    unsigned int USTC:1;                    /**< \brief [10:10] Upstream Timout Clear (w) */
    unsigned int USTS:1;                    /**< \brief [11:11] Upstream Timout Set (w) */
    unsigned int reserved_12:1;             /**< \brief \internal Reserved */
    unsigned int UTASR:1;                   /**< \brief [13:13] Upstream Timout Alternate Service Request (rw) */
    unsigned int USTOIP:2;                  /**< \brief [15:14] Upstream Timout Interrupt Node Pointer (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_MSC_USCE_Bits;

/** \\brief  Upstream Status Register */
typedef struct _Ifx_MSC_USR_Bits
{
    unsigned int UFT:1;                     /**< \brief [0:0] Upstream Channel Frame Type (rw) */
    unsigned int URR:3;                     /**< \brief [3:1] Upstream Channel Receiving Rate (rw) */
    unsigned int PCTR:1;                    /**< \brief [4:4] Parity Control (rw) */
    unsigned int SRDC:1;                    /**< \brief [5:5] Service Request Delay Control (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int UC:5;                      /**< \brief [20:16] Upstream Counter (rh) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_MSC_USR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Msc_union
 * \{  */

/** \\brief  Asynchronous Block Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ABC_Bits B;
} Ifx_MSC_ABC;

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ACCEN0_Bits B;
} Ifx_MSC_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ACCEN1_Bits B;
} Ifx_MSC_ACCEN1;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_CLC_Bits B;
} Ifx_MSC_CLC;

/** \\brief  Downstream Command Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DC_Bits B;
} Ifx_MSC_DC;

/** \\brief  Downstream Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DD_Bits B;
} Ifx_MSC_DD;

/** \\brief  Downstream Data Extension Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DDE_Bits B;
} Ifx_MSC_DDE;

/** \\brief  Downstream Data Mirror Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DDM_Bits B;
} Ifx_MSC_DDM;

/** \\brief  Downstream Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSC_Bits B;
} Ifx_MSC_DSC;

/** \\brief  Downstream Control Enhanced Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSCE_Bits B;
} Ifx_MSC_DSCE;

/** \\brief  Downstream Select Data Source High Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSDSH_Bits B;
} Ifx_MSC_DSDSH;

